IRP/src/Catalogs/AddAttributeAndPropertySets/AddAttributeAndPropertySets.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>AddAttributeAndPropertySets</name>
 <predefined>
  <items>
   <name>Catalog_ItemKeys</name>
  </items>
  <items>
   <name>Catalog_Items</name>
  </items>
  <items>
   <name>Catalog_ItemTypes</name>
  </items>
  <items>
   <name>Document_SalesInvoice</name>
  </items>
  <items>
   <name>Catalog_Partners</name>
  </items>
  <items>
   <name>Catalog_ExpenseAndRevenueTypes</name>
  </items>
  <items>
   <name>Catalog_BusinessUnits</name>
  </items>
  <items>
   <name>Catalog_PriceKeys</name>
  </items>
  <items>
   <name>Document_SalesOrder</name>
  </items>
  <items>
   <name>Catalog_ChequeBonds</name>
  </items>
  <items>
   <name>Catalog_Specifications</name>
  </items>
  <items>
   <name>Document_PurchaseInvoice</name>
  </items>
  <items>
   <name>Document_PurchaseOrder</name>
  </items>
  <items>
   <name>Catalog_Agreements</name>
  </items>
  <items>
   <name>Catalog_CashAccounts</name>
  </items>
  <items>
   <name>Catalog_Companies</name>
  </items>
  <items>
   <name>Catalog_Countries</name>
  </items>
  <items>
   <name>Catalog_Currencies</name>
  </items>
  <items>
   <name>Catalog_PriceTypes</name>
  </items>
  <items>
   <name>Catalog_SerialLotNumbers</name>
  </items>
  <items>
   <name>Catalog_Stores</name>
  </items>
  <items>
   <name>Catalog_Taxes</name>
  </items>
  <items>
   <name>Catalog_Units</name>
  </items>
  <items>
   <name>Catalog_Users</name>
  </items>
  <items>
   <name>Document_BankPayment</name>
  </items>
  <items>
   <name>Document_BankReceipt</name>
  </items>
  <items>
   <name>Document_Bundling</name>
  </items>
  <items>
   <name>Document_CashExpense</name>
  </items>
  <items>
   <name>Document_CashPayment</name>
  </items>
  <items>
   <name>Document_CashReceipt</name>
  </items>
  <items>
   <name>Document_CashRevenue</name>
  </items>
  <items>
   <name>Document_CashTransferOrder</name>
  </items>
  <items>
   <name>Document_GoodsReceipt</name>
  </items>
  <items>
   <name>Document_IncomingPaymentOrder</name>
  </items>
  <items>
   <name>Document_InventoryTransfer</name>
  </items>
  <items>
   <name>Document_InventoryTransferOrder</name>
  </items>
  <items>
   <name>Document_Labeling</name>
  </items>
  <items>
   <name>Document_OpeningEntry</name>
  </items>
  <items>
   <name>Document_OutgoingPaymentOrder</name>
  </items>
  <items>
   <name>Document_PhysicalCountByLocation</name>
  </items>
  <items>
   <name>Document_PhysicalInventory</name>
  </items>
  <items>
   <name>Document_PriceList</name>
  </items>
  <items>
   <name>Document_PurchaseReturn</name>
  </items>
  <items>
   <name>Document_PurchaseReturnOrder</name>
  </items>
  <items>
   <name>Document_ReconciliationStatement</name>
  </items>
  <items>
   <name>Document_SalesReturn</name>
  </items>
  <items>
   <name>Document_SalesReturnOrder</name>
  </items>
  <items>
   <name>Document_ShipmentConfirmation</name>
  </items>
  <items>
   <name>Document_StockAdjustmentAsSurplus</name>
  </items>
  <items>
   <name>Document_StockAdjustmentAsWriteOff</name>
  </items>
  <items>
   <name>Document_Unbundling</name>
  </items>
  <items>
   <name>Catalog_Files</name>
  </items>
  <items>
   <name>Document_RetailSalesReceipt</name>
  </items>
  <items>
   <name>Catalog_PaymentTerminals</name>
  </items>
  <items>
   <name>Document_RetailReturnReceipt</name>
  </items>
  <items>
   <name>Catalog_BankTerms</name>
  </items>
  <items>
   <name>Catalog_RetailCustomers</name>
  </items>
  <items>
   <name>Document_CashStatement</name>
  </items>
  <items>
   <name>Catalog_CashStatementStatuses</name>
  </items>
  <items>
   <name>Document_CreditNote</name>
  </items>
  <items>
   <name>Document_DebitNote</name>
  </items>
  <items>
   <name>Catalog_Workstations</name>
  </items>
  <items>
   <name>Catalog_Hardware</name>
  </items>
  <items>
   <name>Catalog_ItemSegments</name>
  </items>
  <items>
   <name>Catalog_PartnerSegments</name>
  </items>
  <items>
   <name>Catalog_PaymentTypes</name>
  </items>
  <items>
   <name>Catalog_SpecialOfferRules</name>
  </items>
  <items>
   <name>Catalog_SpecialOffers</name>
  </items>
  <items>
   <name>Catalog_SpecialOfferTypes</name>
  </items>
  <items>
   <name>Catalog_TaxRates</name>
  </items>
  <items>
   <name>Catalog_UserGroups</name>
  </items>
  <items>
   <name>Document_InternalSupplyRequest</name>
  </items>
  <items>
   <name>Catalog_PartnersBankAccounts</name>
  </items>
  <items>
   <name>Catalog_LockDataModificationReasons</name>
  </items>
  <items>
   <name>Document_ItemStockAdjustment</name>
  </items>
  <items>
   <name>Document_ManualRegisterEntry</name>
  </items>
  <items>
   <name>Document_SalesOrderClosing</name>
  </items>
  <items>
   <name>Document_PlannedReceiptReservation</name>
  </items>
  <items>
   <name>Document_PurchaseOrderClosing</name>
  </items>
  <items>
   <name>Catalog_PartnerItems</name>
  </items>
  <items>
   <name>Document_JournalEntry</name>
  </items>
  <items>
   <name>Catalog_LedgerTypes</name>
  </items>
  <items>
   <name>Document_MoneyTransfer</name>
  </items>
  <items>
   <name>Catalog_AccessGroups</name>
  </items>
  <items>
   <name>Catalog_AccessProfiles</name>
  </items>
  <items>
   <name>Catalog_AccountingOperations</name>
  </items>
  <items>
   <name>Catalog_CancelReturnReasons</name>
  </items>
  <items>
   <name>Catalog_EquipmentDrivers</name>
  </items>
  <items>
   <name>Catalog_ExternalDataProc</name>
  </items>
  <items>
   <name>Catalog_FileStoragesInfo</name>
  </items>
  <items>
   <name>Catalog_FileStorageVolumes</name>
  </items>
  <items>
   <name>Catalog_IntegrationSettings</name>
  </items>
  <items>
   <name>Catalog_InterfaceGroups</name>
  </items>
  <items>
   <name>Catalog_LegalNameContracts</name>
  </items>
  <items>
   <name>Catalog_ObjectStatuses</name>
  </items>
  <items>
   <name>Catalog_PaymentSchedules</name>
  </items>
  <items>
   <name>Catalog_PlanningPeriods</name>
  </items>
  <items>
   <name>Catalog_TaxAnalytics</name>
  </items>
  <items>
   <name>Catalog_UnitsOfMeasurement</name>
  </items>
  <items>
   <name>Catalog_LedgerTypeVariants</name>
  </items>
  <items>
   <name>Document_ChequeBondTransaction</name>
  </items>
  <items>
   <name>Document_ConsolidatedRetailSales</name>
  </items>
  <items>
   <name>Document_WorkOrder</name>
  </items>
  <items>
   <name>Document_WorkOrderClosing</name>
  </items>
  <items>
   <name>Catalog_BillOfMaterials</name>
  </items>
  <items>
   <name>Document_WorkSheet</name>
  </items>
  <items>
   <name>Catalog_FillingTemplates</name>
  </items>
  <items>
   <name>Document_ProductionPlanning</name>
  </items>
  <items>
   <name>Document_ProductionPlanningCorrection</name>
  </items>
  <items>
   <name>Document_ProductionPlanningClosing</name>
  </items>
  <items>
   <name>Document_Production</name>
  </items>
  <items>
   <name>Document_SalesReportFromTradeAgent</name>
  </items>
  <items>
   <name>Document_SalesReportToConsignor</name>
  </items>
  <items>
   <name>Catalog_SourceOfOrigins</name>
  </items>
  <items>
   <name>Document_EmployeeCashAdvance</name>
  </items>
  <items>
   <name>Document_ProductionCostsAllocation</name>
  </items>
  <items>
   <name>Document_Payroll</name>
  </items>
  <items>
   <name>Catalog_AccrualAndDeductionTypes</name>
  </items>
  <items>
   <name>Catalog_EmployeePositions</name>
  </items>
  <items>
   <name>Document_TimeSheet</name>
  </items>
  <items>
   <name>Catalog_Addresses</name>
  </items>
  <items>
   <name>Catalog_Vehicles</name>
  </items>
  <items>
   <name>Catalog_VehicleTypes</name>
  </items>
  <items>
   <name>Document_RetailShipmentConfirmation</name>
  </items>
  <items>
   <name>Document_RetailGoodsReceipt</name>
  </items>
  <items>
   <name>Catalog_FixedAssets</name>
  </items>
  <items>
   <name>Catalog_DepreciationSchedules</name>
  </items>
  <items>
   <name>Catalog_FixedAssetsLedgerTypes</name>
  </items>
  <items>
   <name>Document_CommissioningOfFixedAsset</name>
  </items>
  <items>
   <name>Document_DecommissioningOfFixedAsset</name>
  </items>
  <items>
   <name>Document_FixedAssetTransfer</name>
  </items>
  <items>
   <name>Document_ModernizationOfFixedAsset</name>
  </items>
  <items>
   <name>Document_EmployeeHiring</name>
  </items>
  <items>
   <name>Document_EmployeeTransfer</name>
  </items>
  <items>
   <name>Document_EmployeeFiring</name>
  </items>
  <items>
   <name>Document_EmployeeVacation</name>
  </items>
  <items>
   <name>Document_EmployeeSickLeave</name>
  </items>
  <items>
   <name>Document_AdditionalAccrual</name>
  </items>
  <items>
   <name>Document_AdditionalDeduction</name>
  </items>
  <items>
   <name>Catalog_EmployeeSchedule</name>
  </items>
  <items>
   <name>Document_VisitorCounter</name>
  </items>
  <items>
   <name>Document_RetailReceiptCorrection</name>
  </items>
  <items>
   <name>Catalog_Projects</name>
  </items>
  <items>
   <name>Document_DebitCreditNote</name>
  </items>
  <items>
   <name>Catalog_AgingPeriods</name>
  </items>
  <items>
   <name>Catalog_Incoterms</name>
  </items>
  <items>
   <name>Catalog_SalaryCalculationType</name>
  </items>
  <items>
   <name>Catalog_AttachedDocumentSettings</name>
  </items>
  <items>
   <name>Document_ExpenseAccruals</name>
  </items>
  <items>
   <name>Document_RevenueAccruals</name>
  </items>
  <items>
   <name>Document_TaxesOperation</name>
  </items>
 </predefined>
 <tabularSections>
  <name>Attributes</name>
  <attributes>
   <name>Attribute</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Condition</name>
   <type>
    <types>ValueStorage</types>
   </type>
  </attributes>
  <attributes>
   <name>IsConditionSet</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>10</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>InterfaceGroup</name>
   <comment>Name of group for attribute</comment>
   <type>
    <types>CatalogRef.InterfaceGroups</types>
   </type>
  </attributes>
  <attributes>
   <name>Required</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>ShowInHTML</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Collection</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>DefaultName</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>150</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>PathForTag</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>150</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>Properties</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Condition</name>
   <type>
    <types>ValueStorage</types>
   </type>
  </attributes>
  <attributes>
   <name>IsConditionSet</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>10</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>ShowInHTML</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Collection</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>DefaultName</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>150</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>ExtensionAttributes</name>
  <attributes>
   <name>Attribute</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>128</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>Condition</name>
   <type>
    <types>ValueStorage</types>
   </type>
  </attributes>
  <attributes>
   <name>IsConditionSet</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>10</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>InterfaceGroup</name>
   <comment>Name of group for attribute</comment>
   <type>
    <types>CatalogRef.InterfaceGroups</types>
   </type>
  </attributes>
  <attributes>
   <name>Required</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>ShowInHTML</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Show</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/CommonModules/ExtensionServer/Module.bsl
#Region Service

Procedure InstallExtention(Name, ExtensionData, OverWrite = True) Export
	If ExtensionData = Undefined Then
		Return;
	EndIf;

	ArrayExt = ConfigurationExtensions.Get(New Structure("Name", Name));
	If ArrayExt.Count() Then
		If Not OverWrite Then
			Return;
		EndIf;
		Ext = ArrayExt[0];
	Else
		Ext = ConfigurationExtensions.Create();
	EndIf;

	Ext.Active = True;
	Ext.SafeMode = False;
	Ext.Write(ExtensionData);
EndProcedure

#EndRegion

#Region AddExtensionsAttributes

Procedure AddAttributesFromExtensions(Form, MetaTypeOrRef, ItemElement = Undefined) Export
	Types = New Array();
	Types.Add(Type("Boolean"));
	BooleanTypeDescription = New TypeDescription(Types);

	ElementParent = Undefined;

	If Not ItemElement = Undefined Then
		If TypeOf(ItemElement) = Type("FormGroup") Then
			If ItemElement.Type = FormGroupType.Pages Then
				ElementParent  = Form.Items.Add("ExtAttributes", Type("FormGroup"), ItemElement);
				ElementParent.Type = FormGroupType.Page;
				ElementParent.Title = R().Form_029;
			ElsIf ItemElement.Type = FormGroupType.Page Or ItemElement.Type = FormGroupType.UsualGroup Then
				ElementParent = ItemElement;
			EndIf;
		EndIf;
	EndIf;

	ObjectMetadata = Metadata.FindByType(TypeOf(MetaTypeOrRef));
	AttributesList = Catalogs.AddAttributeAndPropertySets.GetExtensionAttributesListByObjectMetadata(ObjectMetadata, MetaTypeOrRef);
	FormGroups = AddAttributesAndPropertiesServer.FormGroups(AttributesList);
	If ElementParent <> Undefined Then
		For Each FormGroup In FormGroups Do
			FormGroup.ParentName = ElementParent.Name;
		EndDo;
	EndIf;
	AddAttributesAndPropertiesServer.CreateFormGroups(Form, FormGroups);

	For Each Attribute In AttributesList Do
		If ValueIsFilled(Attribute.InterfaceGroup) Then
			ParentName = "_" + StrReplace(Attribute.InterfaceGroup.UUID(), "-", "");
			Parent = Form.Items[ParentName];
		ElsIf ElementParent <> Undefined Then
			Parent = ElementParent;
		Else
			Parent = Form;
		EndIf;

		NewAttribute = Form.Items.Add(Attribute.Attribute, Type("FormField"), Parent);
		NewAttribute.Type = FormFieldType.InputField;
		NewAttribute.DataPath = "Object." + Attribute.Attribute;
		If ObjectMetadata.Attributes.Find(Attribute.Attribute) = Undefined Then
			If Metadata.CommonAttributes[Attribute.Attribute].Type = BooleanTypeDescription Then
				NewAttribute.Type = FormFieldType.CheckBoxField;
			EndIf;
		Else
			If ObjectMetadata.Attributes[Attribute.Attribute].Type = BooleanTypeDescription Then
				NewAttribute.Type = FormFieldType.CheckBoxField;
			EndIf;
		EndIf;
	EndDo;

	For Each TabularSection In ObjectMetadata.TabularSections Do
		For Each Column In TabularSection.Attributes Do
			If Not StrFind(Column.Name, "_") Then
				Continue;
			EndIf;
			If StrStartsWith(Column.Name, "DELETE_") Then
				Continue;
			EndIf;
			Parent = Form.Items.Find(TabularSection.Name);
			If Parent = Undefined Then
				Continue;
			EndIf;

			NewColumn = Form.Items.Add(Column.Name, Type("FormField"), Parent);
			NewColumn.Type = FormFieldType.InputField;
			NewColumn.DataPath = "Object." + TabularSection.Name + "." + Column.Name;
			If Column.Type = BooleanTypeDescription Then
				NewColumn.Type = FormFieldType.CheckBoxField;
			EndIf;
		EndDo;
	EndDo;
EndProcedure

#EndRegion
